In [2]:
import pandas as pd
import numpy as np

In [82]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["roww1","roww2","roww3","roww4","roww5"],columns=["columnn1","columnn2","columnn3","columnn4"])

In [83]:
df

       columnn1  columnn2  columnn3  columnn4
roww1         0         1         2         3
roww2         4         5         6         7
roww3         8         9        10        11
roww4        12        13        14        15
roww5        16        17        18        19

In [33]:
df.loc[:,"columnn1":"columnn3"]

       columnn1  columnn2  columnn3
roww1         0         1         2
roww2         4         5         6
roww3         8         9        10
roww4        12        13        14
roww5        16        17        18

In [25]:
df.iloc[0:2,:]

       columnn1  columnn2  columnn3  columnn4
roww1         0         1         2         3
roww2         4         5         6         7

In [27]:
df

       columnn1  columnn2  columnn3  columnn4
roww1         0         1         2         3
roww2         4         5         6         7
roww3         8         9        10        11
roww4        12        13        14        15
roww5        16        17        18        19

In [38]:
df.iloc[:,1:].values
#into array use iloc
#iloc -> index and loc use name of that row or column

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [39]:
df.isnull()

       columnn1  columnn2  columnn3  columnn4
roww1     False     False     False     False
roww2     False     False     False     False
roww3     False     False     False     False
roww4     False     False     False     False
roww5     False     False     False     False

In [42]:
df.isnull().sum()

columnn1    0
columnn2    0
columnn3    0
columnn4    0
dtype: int64

In [44]:
df

       columnn1  columnn2  columnn3  columnn4
roww1         0         1         2         3
roww2         4         5         6         7
roww3         8         9        10        11
roww4        12        13        14        15
roww5        16        17        18        19

In [84]:
df[["columnn2","columnn3"]].value_counts()

columnn2  columnn3
1         2           1
5         6           1
9         10          1
13        14          1
17        18          1
dtype: int64

In [57]:
idx = pd.Index(['Harry', 'Mike', 'Arther', 'Nick',
                'Harry', 'Arther'], name ='Student')

In [60]:
idx.head()

AttributeError: 'Index' object has no attribute 'head'

array([ 1,  5,  9, 13, 17])

In [86]:
data = [['tom', 10,"m"], ['nick', 15,"m"], ['nick', 14,"m"]]
 
# Create the pandas DataFrame
idx = pd.DataFrame(data, columns = ['Name', 'Age',"sex"])

In [87]:
idx

   Name  Age sex
0   tom   10   m
1  nick   15   m
2  nick   14   m

In [88]:
idx[["Name","sex"]].value_counts()
#df[["columnn2","columnn3"]].value_counts()
#checking both name and sex for similarities -> like AND condition

Name  sex
nick  m      2
tom   m      1
dtype: int64

In [73]:
df

   Name  Age sex
0   tom   10   m
1  nick   15   m
2  nick   14   f

In [74]:
df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'